projects/writing/anime/2022_summer_pre/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-20 Thu 16:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Eric" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb8674e0">1. Summer 2022 Previews</a>
<ul>
<li><a href="#orgdda969c">1.1. OP</a></li>
<li><a href="#org27e72a0">1.2. Frank Boardman "Pistol Pete" Eaton</a>
<ul>
<li><a href="#orge3bc8f9">1.2.1. Summertime Render</a></li>
<li><a href="#org68cffed">1.2.2. Ao Ashi</a></li>
<li><a href="#orgccc0fbe">1.2.3. Onipan</a></li>
</ul>
</li>
<li><a href="#orgdfb44ff">1.3. William Frederick "Buffalo Bill" Cody</a>
<ul>
<li><a href="#orgcaebd09">1.3.1. Overlord IV</a></li>
<li><a href="#org3951924">1.3.2. Danmachi IV</a></li>
<li><a href="#orga96a882">1.3.3. MADE IN ABYSS</a></li>
</ul>
</li>
<li><a href="#org0682a38">1.4. Charlie Siringo</a>
<ul>
<li><a href="#orgd7b4237">1.4.1. Isekai Ojisan</a></li>
<li><a href="#org70dbc8d">1.4.2. Lycoris Recoil</a></li>
<li><a href="#org76e6a18">1.4.3. Bucchigire!</a></li>
<li><a href="#orgdc0abf1">1.4.4. Warau Arsnotoria Sun&#x2013;!</a></li>
<li><a href="#orga2bdef7">1.4.5. Yurei Deco</a></li>
<li><a href="#org4f4374d">1.4.6. KJ File</a></li>
</ul>
</li>
<li><a href="#orgd001c0c">1.5. Theodore Roosevelt</a>
<ul>
<li><a href="#org8a74e80">1.5.1. Yofukashi no Uta</a></li>
<li><a href="#org9109d07">1.5.2. Hoshi no Samidare</a></li>
<li><a href="#org72163ed">1.5.3. RWBY: Hyosetsu Teikoku</a></li>
<li><a href="#org7a19ae6">1.5.4. Kuro no Shoukanshi</a></li>
</ul>
</li>
<li><a href="#orgbfb1a8a">1.6. ED</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb8674e0" class="outline-2">
<h2 id="orgb8674e0"><span class="section-number-2">1</span> Summer 2022 Previews</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgdda969c" class="outline-3">
<h3 id="orgdda969c"><span class="section-number-3">1.1</span> OP</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Howdy,
</p>

<p>
I like saying "howdy", so how'd you like a cow-poke themed anime preview? What? It's the rootin' tootin'-est thing you've ever laid eye upon? Shucks.
</p>
</div>
</div>

<div id="outline-container-org27e72a0" class="outline-3">
<h3 id="org27e72a0"><span class="section-number-3">1.2</span> Frank Boardman "Pistol Pete" Eaton</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This guy lived to be almost 100, so that's a good enough reason for me to use him as an analogy for shows that I'm still watching from last season.
</p>
</div>
<div id="outline-container-orge3bc8f9" class="outline-4">
<h4 id="orge3bc8f9"><span class="section-number-4">1.2.1</span> Summertime Render</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Bloop, bloop, I am watching this.
</p>
</div>
</div>

<div id="outline-container-org68cffed" class="outline-4">
<h4 id="org68cffed"><span class="section-number-4">1.2.2</span> Ao Ashi</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Bleep, blorp, I am watching this.
</p>
</div>
</div>

<div id="outline-container-orgccc0fbe" class="outline-4">
<h4 id="orgccc0fbe"><span class="section-number-4">1.2.3</span> Onipan</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Blop, blap, I will probably catch up on this cause it's fine.
</p>
</div>
</div>
</div>

<div id="outline-container-orgdfb44ff" class="outline-3">
<h3 id="orgdfb44ff"><span class="section-number-3">1.3</span> William Frederick "Buffalo Bill" Cody</h3>
<div class="outline-text-3" id="text-1-3">
<p>
I recognize this guy's name. These are the shows that make me think, "I recognize this guy's name."
</p>
</div>
<div id="outline-container-orgcaebd09" class="outline-4">
<h4 id="orgcaebd09"><span class="section-number-4">1.3.1</span> Overlord IV</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
My favorite story about the politics of a corporation trying to consolidate its position. I guess this season introduces some competitors?
</p>
</div>
</div>

<div id="outline-container-org3951924" class="outline-4">
<h4 id="org3951924"><span class="section-number-4">1.3.2</span> Danmachi IV</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
I'm not super  excited to watch another season of this, but feel an obligation to keep going. As long as there are a couple exciting moments I'll feel justified in sticking with this.
</p>
</div>
</div>

<div id="outline-container-orga96a882" class="outline-4">
<h4 id="orga96a882"><span class="section-number-4">1.3.3</span> MADE IN ABYSS</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
The market of values is fun, but I might have to reread the manga to remember stuff.
</p>
</div>
</div>
</div>

<div id="outline-container-org0682a38" class="outline-3">
<h3 id="org0682a38"><span class="section-number-3">1.4</span> Charlie Siringo</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Apparently this guy became a Pinkerton, but was sympathetic to some union workers and may have prevented a few lynchings. These are shows that make me think, "Hey, this show may suck or it may be sympathetic to union workers."
</p>
</div>
<div id="outline-container-orgd7b4237" class="outline-4">
<h4 id="orgd7b4237"><span class="section-number-4">1.4.1</span> Isekai Ojisan</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Hmm, I'll watch this, but am not sure what to expect. The animation in the promo was alright, although the line quality was funky enough that I'm not sure if it's an indicator of an ambitious team or they just spent their budget on a filter and are going to cut corners somewhere else. I think the director (Shigeki Kawai) has done a bunch of action work in the past, but this doesn't look like an action-heavy show. And I'm not sure how ecchi this is going to be, cause the manga cover looks like it could go either way and the studio previously did Ganbare Douki-chan, which has, ahem, caught my eye on r/manga, but I don't know if the anime was any good.
</p>
</div>
</div>

<div id="outline-container-org70dbc8d" class="outline-4">
<h4 id="org70dbc8d"><span class="section-number-4">1.4.2</span> Lycoris Recoil</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
The promo video didn't catch me, but I like the promo image and the description. Who doesn't want to see a silly cafe show?
</p>

<p>
I like the character designer (Imigi Muru)'s manga, but don't know the scriptwriter (Asaura)'s work other than some peripheral knowledge that Ben-To seems shlocky.
</p>

<p>
Note: I've watched the first episode since writing the above comments, and decided that this could be more than a silly cafe show, but could also be super shlocky.
</p>
</div>
</div>

<div id="outline-container-org76e6a18" class="outline-4">
<h4 id="org76e6a18"><span class="section-number-4">1.4.3</span> Bucchigire!</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
Criminals with magic swords fighting in the dark with funky compositing, sounds neat. There's one shot towards the end of the second promo video where the camera is dynamic, but I'm not convinced it'll be an animation marvel. Just making me care about most of the eight main characters would be enough. I guess Geno Studio did Golden Kamuy which I didn't watch, so I don't know if they'll pull off these very 2000s anime designs.
</p>
</div>
</div>

<div id="outline-container-orgdc0abf1" class="outline-4">
<h4 id="orgdc0abf1"><span class="section-number-4">1.4.4</span> Warau Arsnotoria Sun&#x2013;!</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
I'm gonna watch this, even if it looks like a self-serious Little Witch Academia. The director (Naoyuki Tatsuwa) is a former SHAFT-y, and there were some visually impressive moments in the teaser (like the very first shot which does a weird zoom-out/pan-down combined with going into a fish-eye view).
</p>
</div>
</div>

<div id="outline-container-orga2bdef7" class="outline-4">
<h4 id="orga2bdef7"><span class="section-number-4">1.4.5</span> Yurei Deco</h4>
<div class="outline-text-4" id="text-1-4-5">
<p>
Wooo! I don't know if this will actually be good, in the sense that it looks like a childrens' show. But the description sounds like it could be setting up a mystery.
</p>

<p>
Note: I've since watched the first episode and it's a whimsically portrayed dystopia (reminiscent of Yuasa's Kaiba) but with very contemporary elements. I'll like it more if this has some interesting mystery or asks unexpected questions about society, but it's also a fun world to watch the characters move about in.
</p>
</div>
</div>

<div id="outline-container-org4f4374d" class="outline-4">
<h4 id="org4f4374d"><span class="section-number-4">1.4.6</span> KJ File</h4>
<div class="outline-text-4" id="text-1-4-6">
<p>
I know nothing about this, but the director (Funada Akira) produced something called Business Fish, which I've not watched but has convinced me this will be amazing.
</p>

<p>
Post-watching the first episode (and only translated episode I could find) of Business Fish: I like Business Fish, but would also not be surprised if the minds behind Business Fish created a non-Business Fish show that I didn't like as much as Business Fish. Buiiiisinessssss Fiiiiiish. That's a fish, that does business.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd001c0c" class="outline-3">
<h3 id="orgd001c0c"><span class="section-number-3">1.5</span> Theodore Roosevelt</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Is this guy best described as a cowboy? Probably not, but Wikipedia decided to put him on a list of cowfolks, and who am I to squabble with strangers on the internet? These are the shows that make me think, "Is this best done as an anime?"
</p>
</div>
<div id="outline-container-org8a74e80" class="outline-4">
<h4 id="org8a74e80"><span class="section-number-4">1.5.1</span> Yofukashi no Uta</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
I like how colorful the promo is, but not sure if that's enough for me to watch this. I like the manga well enough though.
</p>
</div>
</div>

<div id="outline-container-org9109d07" class="outline-4">
<h4 id="org9109d07"><span class="section-number-4">1.5.2</span> Hoshi no Samidare</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
If this isn't good, I'm going to be so sad.
</p>
</div>
</div>

<div id="outline-container-org72163ed" class="outline-4">
<h4 id="org72163ed"><span class="section-number-4">1.5.3</span> RWBY: Hyosetsu Teikoku</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
All I really know about RWBY is that one of my favorite mangaka (Miwa Shirow) took a hiatus from Dogs: Bullets and Carnage to presumably (or maybe just coincidentally) work on the RWBY manga. And never went back to Dogs. Boo. I don't love the look of the CG.
</p>
</div>
</div>

<div id="outline-container-org7a19ae6" class="outline-4">
<h4 id="org7a19ae6"><span class="section-number-4">1.5.4</span> Kuro no Shoukanshi</h4>
<div class="outline-text-4" id="text-1-5-4">
<p>
Why does the main character have a knife behind his ear?
</p>
</div>
</div>
</div>

<div id="outline-container-orgbfb1a8a" class="outline-3">
<h3 id="orgbfb1a8a"><span class="section-number-3">1.6</span> ED</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Tata,
Eric
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Eric</p>
<p class="date">Created: 2023-04-20 Thu 16:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
